OdDAI.ConstructedType.elements
\details
Retrieves a list of values for an enumeration data type.
\returns A list of ANSI-strings that contains values of the enumeration data type.

OdDAI.ConstructedType.isSelectType
\details
Determines whether the nested data type is a select data type.
\returns true if the nested data type is a select data type; otherwise, the method returns false.

OdDAI.ConstructedType.isEnumerationType
\details
Determines whether the nested data type is an enumeration data type.
\returns true if the nested data type is an enumeration data type; otherwise, the method returns false.

OdDAI.ConstructedType.unset
\details
Clears the nested data type. The nested data type is unset after the method is executed.

OdDAI.ConstructedType.exists
\details
Checks whether the nested data type is specified within the constructed type instance.
\returns 1 if the nested data type is specified; otherwise (nested data type is unset), the method returns 0.

OdDAI.ConstructedType.#ctor
\details
Creates an instance of constructed data type definition with default parameters.
The nested data type for the created object is unset.

OdDAI.ConstructedType
\details
A base class that implements the storing and manipulating of enumeration and select data types definitions.